<template>
  <div class="content">
    <div class="main-content user-contract contract-personal">
      <h2>借款服务协议</h2>
      <div class="user-header">
        <div class="contract-number">
          <p><span>借款合同编号:</span><span></span></p>
        </div>
        <div class="user-first mt40">
          <p><span>甲方（借款人）:</span><span></span></p>
        </div>
        <div><p>居民身份证号码/企业统一社会信用代码：</p></div>
        <div class="user-second mt40">
          <p><span>乙方（服务方）：杭州米今网络科技有限公司</span></p>
        </div>
        <div><p>统一社会信用代码：91330108MA28W87C7D</p></div>
        <div class="user-second mt40">
          <p><span>丙方（服务方）：浙江小泰科技有限公司</span></p>
        </div>
        <div><p>统一社会信用代码：91330108098418914D</p></div>
      </div>
      <div class="contract-content mt40">
        <p><b>鉴于:</b></p>
      </div>
      <p>1、甲方是乙方运营之平台米今科技成功注册的用户，甲方有借款需求，愿意将其个人身份信息及借款需求提供给乙方，由乙方将该借款需求推送给丙方，并由丙方将该借款需求在其运营的泰然金融为甲方匹配出借人，撮合甲方与出借人达成网络借贷交易，并代为其与出借人签署借款协议及相关协议。</p>
      <!--<h3>一、协议的签订与修改</h3>-->
      <p>2. 乙方是一家在浙江杭州合法成立并有效存续的有限公司，拥有米今科技网站平台网址：http://www.360mijin.com/的经营权，为借款人甲方提供借款咨询、资料审核、还款提醒、还款管理、贷后管理等服务，并为丙方提供借款需求信息。</p>
      <p>3. 丙方是一家在浙江杭州合法成立并有效存续的有限公司，拥有 www.trc.com 网站（以下简称“泰然金融”）的经营权，提供信息咨询，为网络借贷交易提供信息及撮合服务。</p>
      <p>甲方欲通过乙方、丙方的撮合借款，各方经平等协商一致签订本协议，以资共同遵照履行：</p>
      <h3> 一、	定义</h3>
      <p><b>1、本协议：</b>指本《借款服务协议》及其全部附属合同和附件的统称。</p>
      <p><b>2、借款人：</b>指具有一定的资金需求，经过丙方信用评估后筛选推荐、并通过丙方提供的居间服务，从而得到出借人出借资金且具有完全民事权利和行为能力的自然人或机构。在本协议即为甲方。</p>
      <p><b>3、出借人：</b>经丙方平台匹配与借款人签订借款协议等相关合同文件，向借款人出借资金，具有完全民事权利和行为能力的自然人或机构。</p>
      <p><b>4、《借款协议》：</b>为在甲方与出借人之间建立网络借贷合同关系，由出借人与甲方所签订，约定双方在资金出借中各自权利义务的一系列合同文本。本协议通过电子方式在泰然金融平台签署，并以电子协议的形式存在。</p>

      <h3>二、服务内容</h3>
      <p>1、甲方在乙方平台注册成为乙方用户，按照附件格式提出借款需求及明细，乙方搜集甲方借款需求并初步审核通过的，甲方委托乙方代其向丙方提供符合丙方要求的借款资料及信息，并同意授权乙方将其借款需求、借款资料及信息、审核结果推送给丙方，由丙方对借款人提交的借款申请等资料进行最终审核，并决定是否向甲方提供居间服务。丙方审核通过的，将通过泰然金融平台向甲方推荐出借人并撮合双方借贷关系成立。</p>
      <p>2、具体借款需求包含于附件《借款申请单》中，丙方将按照该申请单为甲方匹配相对应的出借人，且保证在泰然金融签署的借款协议不得违反申请单所确定的内容。</p>
      <p>3、甲方在T日提出贷款申请后，乙方需帮助甲方在T+1个工作日内完成审核，若审核通过,则将甲方的借款需求推送给丙方；如果审核不通过,则由乙方通知甲方并停止继续提供服务。</p>
      <p>4、甲方借款成功后，乙方为甲方提供信息搜集、还款提醒、还款管理、贷后管理等服务。若甲方逾期还款的，受出借人或出借人将债权在丙方平台转让后的债权受让人委托，乙方提供催收等服务并有权将贷后管理及逾期催收服务委托第三方完成。</p>

      <h3>三、本协议及相关协议的订立</h3>
      <p>1、三方同意并确认：本协议采用电子文本形式制成，并永久保存在乙方、丙方为此设立的专用服务器上备查，各方均认可本形式的法律效力。</p>
      <p>2、甲方同意并确认：就丙方在<a>泰然金融</a>发布甲方借款需求并为甲方所匹配的出借人，甲方不可撤销的授权丙方使用其电子签章与出借人在泰然金融签署电子借款协议。借款协议经各方签署即成立并生效，保存于丙方平台。甲方可通过丙方查阅、下载借款协议。</p>

      <h3>四、服务费用</h3>
      <p>1、甲方在本协议下匹配借款成功后，需按照《借款协议》的约定，按时足额得向出借人承担本金及利息。</p>
      <p>2、甲方使用乙方的借款居间服务，需向乙方支付服务费用。<b>乙方收费明细详见本协议附件。乙方承诺与借款相关的所有收费不超过借款本金的年化15%。</b></p>
      <p><b>3、甲方同意通过丙方泰然金融平台撮合借款，应当按照借款本金年化3.60%的费率向丙方支付信息服务费。</b></p>
      <p>4、甲方向乙方和丙方支付在本协议项下的所有服务费用，均需按照《借款协议》还款计划的还款期限按期等额支付，甲方同意乙方、丙方在每期还款日从甲方的还款账户中直接扣除该笔款项。</p>
      <p>5、各方确认，各方应自行承担各方应缴纳相关税费的义务。</p>

      <h3>五、操作流程</h3>
      <p>1、甲方通过乙方平台提出个人借款需求，按乙方要求填写、提交相关资料及信息，乙方对甲方借款信息进行尽职调查。若经审核通过，由乙方将甲方四要素（姓名、身份证号、银行卡号、手机号及身份证正反面照）及甲方相关借款信息实时推送给丙方。</p>
      <p>2、丙方在参考乙方尽职调查和审核结果的基础上，利用自身系统对借款人基本情况、还款意愿、还款能力、借款用途、资信状况进行最终审核。若经审核通过，丙方在泰然金融为甲方匹配出借人，撮合网络借款交易，由甲方与出借人以电子方式签署《借款协议》。协议签署完成后，甲方同意借款通过出借人存管子账户划入甲方收款账户，即视为借款完成。对于丙方未审核通过的借款人，丙方应及时将审核结果通知乙方，并由乙方通知甲方。</p>
      <p>3、在资金出借完成后，借款还款日前，甲方可将每笔还款金额（包括但不限于还款本息、服务费等）充值至其还款账户中，并同意由资金存管银行将借款本息进行自动支付给出借人。甲方同意并授权乙方、丙方从其还款账户中扣收乙方应收取的账户管理费。</p>

      <h3>六、各方权利和义务</h3>
      <p>1、甲方权利与义务</p>
      <p>（1）甲方授权丙方在<a>泰然金融</a>代为发起借款请求。</p>
      <p>（2）甲方应按期偿还借款本金及利息。</p>
      <p>（3）甲方必须按期足额向乙方、丙方支付服务费用。</p>
      <p>（4）甲方承诺所借款项不用于任何违法用途。</p>
      <p>（5）甲方在向乙方、丙方支付相关服务费用后可提前还款。</p>
      <p>（6）甲方有义务按照乙方、丙方的要求向乙方、丙方提供真实的借款信息及资料，并承诺信息及资料是完全真实、准确、无瑕疵、无隐瞒的。因甲方提供虚假信息或资料而造成的一切法律后果（包括但不限于民事赔偿，行政处罚等）均由甲方承担。甲方承诺自身非在读学生，并已向乙方、丙方做了充分的信息披露。</p>
      <p><b>（7）甲方承诺在所有网贷平台的借款余额没有超过相关法律规定的限制，自然人不超过100万元，法人不超过500万元。</b></p>
      <p>（8）甲方不得将本协议及借款协议项下的任何权利义务转让给任何其他方。</p>
      <p>2、乙方权利与义务</p>
      <p>（1）乙方向甲方提供与借款有关的信息咨询、信息推介等服务，并有权根据本协议的约定甲方收取服务费用。</p>
      <p>（2）乙方应当勤勉尽职地对借款申请人进行贷前调查、信息搜集，并有权向甲方索取、搜集相关自信审核资料。</p>
      <p>（3）当甲方违反本协议或者借款协议的约定时，乙方有权依丙方、出借人委托，对甲方进行合法催收工作。</p>
      <p>（4）如果在甲方逾期后，乙方代甲方向出借人、丙方平台及其他服务方进行了代偿本金、利息及其他费用，则乙方成为甲方新的债权人。甲方应当按照《借款协议》、相关服务协议及其他文件约定的金额、还款方式，按时足额向乙方还款，并向乙方继续承担所有的逾期责任、违约责任。</p>
      <p>3、	丙方权利与义务</p>
      <p>（1）丙方有权按照本协议的约定向借款人收取服务费用。</p>
      <p>（2）甲方同意丙方有权取得与其借款居间服务有关的全部资料，包括但不限于借款申请人资料、资信资料以及其他有关资料。</p>
      <p>（3）丙方有权按照自身的风控要求和审核标准，对甲方提交资料进行审核批准，独立自主决定是否给甲方提供借贷居间服务。丙方有权为居间借款的目的，对甲方提交的资信资料在泰然金融平台上进行信息披露。</p>

      <h3>七、 违约责任</h3>
      <p>1、任何一方违反本协议的约定，给其他各方造成损失的，应承担相应的违约责任，赔偿由此给其他各方造成的相应损失。其中，因甲方违约致使乙方或丙方采取诉讼或仲裁方式实现债权的，甲方应当承担乙方或丙方为此支付的费用（包括但不限于诉讼费、律师费、差旅费等）及实现债权的其他一切费用。若导致出借人的合法权益遭受损害的，由违约方负责赔偿出借人的相应损失。</p>
      <p>2、如任何一方承担了按相关法律法规或本协议规定应由本协议其他各方承担的责任，或由于本协议其他各方的违约行为而对任何本协议之外的其他方承担责任或受到有权机关处罚，该方在承担责任后有权向违约方进行追偿并获得相应赔偿。</p>

      <h3>八、法律适用及争议解决</h3>
      <p>1、	本协议适用中华人民共和国法律。</p>
      <p>2、	本协议在履行过程中，如发生任何争执或纠纷，各方应友好协商解决。若协商不成，应向乙方住所地有管辖权的人民法院诉讼解决。</p>

      <h3>九、附则</h3>
      <p>1、本协议由各方通过服务界面以点击确认的方式签署。本协议文件一经甲方点击确认，即视为甲方亲笔签名，与线下纸质签约具有同等法律效力。<b>各方均承诺并确认：不以电子签署确认形式为由要求撤销本协议或者确认本协议无效或对本协议效力提出任何异议。</b>本协议经各方签署后立即成立并生效。</p>
      <p>2、本协议采用电子文本形式制成，并永久保存在乙方、丙方为此设立的专用服务器上备查，各方均认可该形式的协议效力。 </p>
      <p><b>本合同三方承诺已详读及同意遵守本合同全部条款。</b></p>
      <div class="user-write-content">
        <p class="write-title">【以下无正文，仅供签署】</p>
        <div><p>协议各方签字盖章：</p></div>
        <div><p>甲方（借款人）：</p></div>
        <div><p>签章：</p></div>
        <div class="mt120"><p>乙方（服务方）：</p></div>
        <div><p>签章：</p></div>
        <div class="mt120"><p>丙方（服务方）：</p></div>
        <div><p>签章：</p></div>
        <div class="mt120 write-date"><p>签订日期：<span></span>年<span></span>月<span></span>日</p></div>
      </div>
      <div class="user-confirm-sheet mt120">
        <p class="confirm-tit">《借款费用确认单》</p>
        <p>本借款申请单从属于编号为<span></span>的《借款服务协议》，作为《借款服务协议》的一部分，与其具有同等法律效力。</p>
        <div class="user-confirm-table">
          <table border="0" cellspacing="0" cellpadding="0">
            <tr>
              <td>借款详细用途</td>
              <td>用于甲方个人消费或/店铺或企业的日常经营</td>
            </tr>
            <tr>
              <td>借款本金数额</td>
              <td>￥<span></span>元（大写：<span></span>）</td>
            </tr>
            <tr>
              <td>借款费率</td>
              <td>
                <p>总月费率=<span></span>%</p>
                <p>（包含月利率、信息服务费）</p>
              </td>
            </tr>
            <tr>
              <td>还款方式</td>
              <td><p><span></span></p></td>
            </tr>
            <tr>
              <td>逾期收费</td>
              <td>
                <p>逾期罚息:<span></span>%</p>
                <p>逾期管理费:<span></span>%</p>
              </td>
            </tr>
            <tr>
              <td>借款周期</td>
              <td>从放款日开始计算<span></span>个月</td>
            </tr>
            <tr>
              <td>还款计划表</td>
              <td>
                <p><b>每期还款计划，以放款日平台生成的还款账单为准</b></p>
                <p><b>（还款日当天23:30前还款，节假日不顺延）。</b></p>
              </td>
            </tr>
            <tr>
              <td>借款人收款账户</td>
              <td>
                <p>名称：<span></span></p>
                <p>账号：<span></span></p>
                <p>开户行：<span></span></p>
              </td>
            </tr>
          </table>
          <div class="applier"><p>申请人（签章）：<span></span></p></div>
          <div class="apply-time"><span></span>年<span></span>月<span></span>日</div>
        </div>
        <div class="auth-doc">
          <h3>授权委托书</h3>
          <p><b>特别提示</b></p>
          <p>尊敬的客户：</p>
          <p>为了保障您的合法权益，请您务必审慎阅读并充分理解本授权书的全部内容，特别是以加粗形式提示您注意的条款。如您对本协议的任何内容有任何疑问的，可向本公司咨询，您也可自行咨询法律专业人士获取解答。若不理解或不同意本授权书任何内容的，请您不要签署本文件。</p>
          <p><b>（以下为授权书正文）</b></p>
          <p>因本人（<span></span>身份证号码/社会统一信用代码<span></span>）申请杭州米今网络科技有限公司（以下统称“米今科技”）和浙江小泰科技有限公司（以下统称“小泰公司”）共同提供的“借款服务”，本人同意本授权书中的所有内容： </p>
          <p>1、因本人借款需求的实现需借助小泰公司通过其平台（即泰然金融平台）匹配符合本人借款需求的出借人，因而需要注册成为泰然金融平台的用户，故本人在此无条件且不可撤销地授权本公司将本人提供的用于实名认证的个人信息（包括但不限于真实姓名、身份证、银行卡号及开户银行、联系方式等）提供给本公司及小泰公司，供本公司和小泰公司代本人办理泰然金融平台的注册或者小泰公司提供网络借款交易居间服务之目的使用。</p>
          <p>2、为依法合规完成本人的网络借贷交易，小泰公司需合作资金存管银行为本人提供交易资金存管等服务，故本人不可撤销地授权小泰公司通过静默开户的形式代本人在小泰公司合作的资金存管银行开户（“静默开户”即小泰公司在泰然金融平台系统中为本人自动生成《泰然金融用户协议》，本人对此协议予以认可）。本人同意接受小泰公司按照用户协议提供借款服务及同意小泰公司合作的资金存管银行为本人开立客户交易结算资金存管账户（该账户为小泰公司合作的存管银行为本人开立的，管理本人在泰然金融平台用于网络借贷交易结算资金的子账户）进行资金存管等事宜。本人在此承诺并确认：不以未实际签署开户协议为由，要求撤销开户协议或者确认开户协议无效或对开户协议效力提出任何异议。</p>
          <p>3、为了小泰公司能够依法合规地为本人提供网络借贷交易的居间服务，本人不可撤销的授权小泰公司将本人的个人信息（包括但不限于真实姓名、身份证、银行卡号及开户银行、联系方式等）披露给与小泰公司合作资金存管银行，用于为本人提供客户交易结算资金存管账户的开户、绑卡等服务使用。本人愿意就其从资金出借人处获取的资金款项，而委托米今科技公司进行代收款。米今科技公司有权决定是否提供前述代收服务，如米今科技愿意代收款项的，则米今科技无需就此向本人支付任何费用及款项，且米今科技提供代收服务的，以资金款项进入甲方认同的账户为准。</p>
          <p>4、小泰公司、本公司应当对本人的个人信息严格保密，除因交易所需或有合法依据外，不得对外披露。</p>
          <p>5、本人同意并确认，本公司或小泰公司有权将本人提供的或其自行收集的本人个人资料信息（包括但不限于真实姓名、身份证、银行卡号及开户银行、联系方式等）用于（包括但不限于）以下用途：（1）基于履行协议、提供服务、解决争议、保障交易安全、控制交易风险等目的使用，且为保障以上目的实现，在必要时向包括但不限于出借人、债权受让人、征信机构、经授权进行贷后管理及逾期催收服务的第三方机构等披露；（2）为良好完成本借款服务，向与借款服务有必要合作关系的第三方提供、查询、收集本人必要的个人资料信息；（3）在不透露个人隐私资料的前提下，有权对包含本人在内的整个用户数据库进行分析并对用户数据库进行商业利用；（4）基于更优质服务之目的，通过使用和分析本人的个人资料信息，向本人提供本人可能感兴趣的产品或服务信息。</p>
          <p>6、本人确认，在下列情形下，本公司或小泰公司有权依法或根据约定在必要范围内披露本人个人资料信息或机构信息：（1）根据法律法规、司法程序或政府主管部门、行业自律组织的要求；（2）事先获得本人同意或授权的其他情形。</p>
          <p>特别声明：</p>
          <p>本人已知悉本授权书全部内容（特别是加粗字体内容）的含义及因此产生的法律效力，自愿作出以上授权。本授权书是本人真实意思表示，本人同意承担由此带来的一切法律后果。</p>
          <p>本授权书经本人在本公司提供的服务界面点击确认后即时生效，且效力具有独立性，不因相关业务合同或条款无效或被撤销而无效或失效。本授权一经做出，便不可撤销。</p>
          <p>授权人：<span></span></p>
          <p>日期：<span></span>年<span></span>月<span></span>日</p>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
  export default {
    name: 'usersPersonalAuthPage',
    data () {
      return {}
    },
    created(){
    },
    methods: {
    }
  }
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style lang="scss" scoped>
  .contract-personal  {
    h3 {
      text-align: left;
    }
    p {
      margin-top: 20px;
    }
  }
.user-header {
  >div {
    line-height: 40px;
    >p {
      text-indent: 2em;
    }
  }
  .contract-number {
    text-align: right;
    span {
      display: inline-block;
      line-height:40px;
    }
    span:last-child {
      width:150px;
      border-bottom: 1px solid #333;
      margin-bottom: -5px;
    }
  }
  .user-first {
    >p {
      text-indent: 1em;
    }
    span {
      display: inline-block;
      line-height:40px;
      font-weight:bold;
    }
    span:last-child {
      width:150px;
      border-bottom: 1px solid #333;
      margin-bottom: -5px;
    }
  }
  .user-second {
    font-weight: bold;
  }
}
.mt20 {
  margin-top: 20px;
}
  .mt40 {
    margin-top: 40px;
  }
  .user-write-content {
    margin-top: 80px;
    .write-title {
      text-align: center;
      line-height: 60px;
    }
  }
  .mt120{
    margin-top: 120px;
  }
  .write-date {
    p{
      span {
        display: inline-block;
        width: 60px;
        height: 40px;
        line-height: 40px;
        border-bottom: 1px solid #333;
        margin: 0 10px;
      }
    }
  }
  .user-confirm-sheet {
    .confirm-tit {
      text-align: center;
      font-size: 150%;
      line-height:100px;
    }
    p {
      span {
        display: inline-block;
        width: 100px;
        height: 40px;
        line-height: 40px;
        border-bottom: 1px solid #666;
        margin-bottom: -5px;
      }
    }
    .user-confirm-table {
      margin-top: 20px;
      table {
        width: 100%;
        border-left: 1px solid #666;
        border-top: 1px solid #666;
        td {
          border-right: 1px solid #666;
          border-bottom: 1px solid #666;
          padding: 10px 0 10px 40px;
          p {
            line-height: 50px;
            text-indent: 0;
          }
          span {
            display: inline-block;
            width: 100px;
            height:40px;
            border-bottom: 1px solid #666;
            margin-bottom: -5px;
          }
        }
      }
      .applier {
        text-align: right;
        margin-top: 20px;
        span {
          display: inline-block;
          width: 120px;
          height: 40px;
          margin-bottom: -5px;
          border-bottom:1px solid #666;
        }
      }
      .apply-time {
        text-align: right;
        margin-top: 20px;
        span {
          display: inline-block;
          width: 100px;
          height: 40px;
          margin-bottom: -5px;
          border-bottom: 1px solid #666;
        }
      }
    }
  }
  .auth-doc {
    h3 {
      font-size: 150%;
      font-weight:normal;
      text-align: center;
      margin-top: 180px;
    }
    p {
      span {
        display: inline-block;
        width: 120px;
        height: 40px;
        line-height: 40px;
        border-bottom: 1px solid #666;
        margin-bottom: -5px;
      }
    }
  }
</style>
