<template>
  <div class="content">
    <div class="main-content user-contract contract-personal">
      <h2>借款服务协议</h2>
      <div class="user-header">
        <div class="contract-number">
          <p><span>借款合同编号:</span><span></span></p>
        </div>
        <div class="user-first mt40">
          <p><span>甲方（借款人）:</span><span></span></p>
        </div>
        <div><p>居民身份证号码/企业统一社会信用代码：</p></div>
        <div class="user-second mt40">
          <p><span>乙方（服务方）：杭州米今网络科技有限公司</span></p>
        </div>
        <div><p>统一社会信用代码：91330108MA28W87C7D</p></div>
        <!-- <div class="user-second mt40">
          <p><span>丙方（服务方）：浙江小泰科技有限公司</span></p>
        </div>
        <div><p>统一社会信用代码：91330108098418914D</p></div> -->
      </div>
      <div class="contract-content mt40">
        <p><b>鉴于:</b></p>
      </div>
      <p>1、甲方是乙方运营之平台米今科技成功注册的用户，甲方有借款需求，愿意将其个人身份信息及借款需求提供给乙方，由乙方撮合完成网络借贷交易。</p>
      <!--<h3>一、协议的签订与修改</h3>-->
      <p>2. 乙方是一家在浙江杭州合法成立并有效存续的有限公司，拥有米今科技网站平台网址：https://www.360mijin.com/的经营权，为借款人甲方提供借款咨询、资料审核、还款提醒、还款管理、贷后管理等服务。</p>
      <!-- <p>3. 丙方是一家在浙江杭州合法成立并有效存续的有限公司，拥有 www.trc.com 网站（以下简称“泰然金融”）的经营权，提供信息咨询，为网络借贷交易提供信息及撮合服务。</p> -->
      <p>甲方欲通过乙方的撮合借款，各方经平等协商一致签订本协议，以资共同遵照履行：</p>
      <h3> 一、	定义</h3>
      <p><b>1、本协议：</b>指本《借款服务协议》及其全部附属合同和附件的统称。</p>
      <p><b>2、借款人：</b>指具有一定的资金需求，经过乙方提供的借贷信息服务，从而得到出借人出借资金且具有完全民事权利和行为能力的自然人或机构。在本协议即为甲方。</p>
      <p><b>3、出借人：</b>经乙方或者乙方合作的金融科技机构匹配与借款人签订借款协议等相关合同文件，向借款人出借资金，具有完全民事权利和行为能力的自然人或机构。</p>
      <p><b>4、资金方：</b>指拥有出借人用户、直接撮合借款人与实际出借人达成资金借贷合作的网络借贷信息中介机构</p>
      <p><b>5、《借款协议》：</b>为在甲方与出借人之间建立网络借贷合同关系，由出借人与甲方所签订，约定双方在资金出借中各自权利义务的一系列合同文本。该协议由借贷双方以电子方式签署，并在资金方网络展示备查。</p>

      <h3>二、服务内容</h3>
      <p>1、甲方在乙方平台注册成为乙方用户，并提出借款需求，乙方搜集甲方借款需求并初步审核通过的，甲方同意授权乙方将其借款需求、借款资料及信息、审核结果向合作资金方推送，由资金方对借款人提交的借款申请等资料进行最终审核，并决定是否向甲方提供居间服务。资金方审核通过的，将通过资金方平台向甲方推荐出借人并撮合双方借贷关系成立。</p>
      <p>2、甲方在T日提出贷款申请后，乙方需帮助甲方在T+1个工作日内完成审核，若审核通过,则将甲方的借款需求推送给资金方；如果审核不通过,则由乙方通知甲方并停止继续提供服务。</p>
      <p>3、甲方借款成功后，乙方为甲方提供信息搜集、还款提醒、还款管理、贷后管理等服务。若甲方逾期还款的，受出借人或出借人将债权在资金方平台转让后的债权受让人委托，乙方提供催收等服务并有权将贷后管理及逾期催收服务委托第三方完成。</p>
      <!-- <p>4、甲方借款成功后，乙方为甲方提供信息搜集、还款提醒、还款管理、贷后管理等服务。若甲方逾期还款的，受出借人或出借人将债权在丙方平台转让后的债权受让人委托，乙方提供催收等服务并有权将贷后管理及逾期催收服务委托第三方完成。</p> -->

      <h3>三、本协议及相关协议的订立</h3>
      <p>1、双方同意并确认：本协议采用电子文本形式制成，并永久保存在乙方、资金方为此设立的专用服务器上备查，各方均认可本形式的法律效力。</p>
      <p>2、甲方同意并确认：就资金方为甲方所匹配的出借人，甲方不可撤销的授权资金方使用其电子签章与出借人在资金方平台签署电子借款协议。借款协议经各方签署即成立并生效，保存于资金方平台。甲方可通过资金方查阅、下载借款协议。</p>

      <h3>四、服务费用</h3>
      <p>1、甲方在本协议下匹配借款成功后，需按照《借款协议》的约定，按时足额得向出借人承担本金及利息。</p>
      <p>2、甲方使用乙方的借款居间服务，需向乙方支付服务费用。<b>乙方按照借款本金，向甲方收取的信息服务费标准见附件一，乙方承诺向甲方收取的所有与借款相关的费用不超过借款本金的年化15%。</b></p>
      <p><b>3、甲方同意通过资金方平台撮合借款，应当按照借款本金年化3.60%的费率向资金方支付信息服务费。</b></p>
      <p>4、甲方向乙方和资金方支付在本协议项下的所有服务费用，均需按照《借款协议》还款计划的还款期限按期等额支付，甲方同意乙方、资金方在每期还款日从甲方的还款账户中直接扣除该笔款项。</p>
      <p>5、各方确认，各方应自行承担各方应缴纳相关税费的义务。</p>

      <h3>五、操作流程</h3>
      <p>1、甲方通过乙方平台提出个人借款需求，按乙方要求填写、提交相关资料及信息，乙方对甲方借款信息进行尽职调查。若经审核通过，由乙方将甲方四要素（姓名、身份证号、银行卡号、手机号及身份证正反面照）及甲方相关借款信息实时推送给资金方。</p>
      <p>2、资金方在参考乙方尽职调查和审核结果的基础上，利用自身系统对借款人基本情况、还款意愿、还款能力、借款用途、资信状况进行最终审核。若经审核通过，资金方为甲方匹配出借人，撮合网络借款交易，由甲方与出借人以电子方式签署《借款协议》。协议签署完成后，甲方同意借款通过出借人存管子账户划入甲方收款账户，即视为借款完成。对于资金方未审核通过的借款人，资金方应及时将审核结果通知乙方，并由乙方通知甲方。</p>
      <p>3、在资金出借完成后，借款还款日前，甲方可将每笔还款金额（包括但不限于还款本息、服务费等）充值至其还款账户中，并同意由资金存管银行将借款本息进行自动支付给出借人。甲方同意并授权乙方、资金方从其还款账户中扣收乙方应收取的借款服务费用。</p>

      <h3>六、各方权利和义务</h3>
      <p>1、甲方权利与义务</p>
      <p>（1）甲方应按期偿还借款本金及利息。</p>
      <p>（2）甲方必须按期足额向乙方、资金方支付服务费用。</p>
      <p>（3）甲方承诺所借款项不用于任何违法用途。</p>
      <p>（4）甲方在向乙方、资金方支付相关服务费用后可提前还款。</p>
      <p>（5）甲方有义务按照乙方、资金方的要求向乙方、资金方提供真实的借款信息及资料，并承诺信息及资料是完全真实、准确、无瑕疵、无隐瞒的。因甲方提供虚假信息或资料而造成的一切法律后果（包括但不限于民事赔偿，行政处罚等）均由甲方承担。<b>甲方承诺自身非在读学生，并已向乙方、资金方做了充分的信息披露。</b></p>
      <p><b>（6）甲方承诺在所有网贷平台的借款余额没有超过相关法律规定的限制，自然人不超过100万元，法人不超过500万元。</b></p>
      <p>（7）甲方不得将本协议及借款协议项下的任何权利义务转让给任何其他方。</p>
      <!-- <p>（8）甲方不得将本协议及借款协议项下的任何权利义务转让给任何其他方。</p> -->
      <p>2、乙方权利与义务</p>
      <p>（1）乙方向甲方提供与借款有关的信息咨询、信息推介等服务，并有权根据本协议的约定向甲方收取服务费用。</p>
      <p>（2）乙方应当勤勉尽职地对借款申请人进行贷前调查、信息搜集，并有权向甲方索取、搜集相关资信审核资料。</p>
      <p>（3）当甲方违反本协议或者借款协议的约定时，乙方有权依资金方、出借人委托，对甲方进行合法催收工作。</p>
      <p><b>（4）如果在甲方逾期后，乙方代甲方向出借人、资金方平台及其他服务方进行了代偿本金、利息及其他费用，则乙方成为甲方新的债权人。甲方应当按照《借款协议》、相关服务协议及其他文件约定的金额、还款方式，按时足额向乙方还款，并向乙方继续承担所有的逾期责任、违约责任。</b></p>
      <p>（5）甲方任何一期还款逾期超过10日，或者累计逾期达到3次或其它乙方认为甲方可能存在无法按期还款的情况发生（包括但不限于发生失业、停业、营业执照被吊销，或被监禁、被宣告失踪、处于限制民事行为能力或丧失民事行为能力状态，或涉及重大诉讼、仲裁、被司法机关采取强制措施等影响还款能力的情况），乙方、资金方和出借人均可宣告借款提前到期。宣告提前到期时甲方的应还款及顺序如下：</p>
      <p>a、宣告提前到期之前已经产生的网贷平台服务费用、实现债权费用、各期罚息，以及各期利息、本金；</p>
      <p>b、宣告提前到期当期的网贷平台服务费用、利息、本金；</p>
      <p>c、宣告提前到期当期之后的全部剩余本金。</p>

      <!-- <p>3、	丙方权利与义务</p>
      <p>（1）丙方有权按照本协议的约定向借款人收取服务费用。</p>
      <p>（2）甲方同意丙方有权取得与其借款居间服务有关的全部资料，包括但不限于借款申请人资料、资信资料以及其他有关资料。</p>
      <p>（3）丙方有权按照自身的风控要求和审核标准，对甲方提交资料进行审核批准，独立自主决定是否给甲方提供借贷居间服务。丙方有权为居间借款的目的，对甲方提交的资信资料在泰然金融平台上进行信息披露。</p> -->

      <h3>七、 违约责任</h3>
      <p>1、任何一方违反本协议的约定，给其他各方造成损失的，应承担相应的违约责任，赔偿由此给其他各方造成的相应损失。其中，因甲方违约致使乙方或资金方采取诉讼或仲裁方式实现债权的，甲方应当承担乙方或资金方为此支付的费用（包括但不限于诉讼费、律师费、差旅费等）及实现债权的其他一切费用。若导致出借人的合法权益遭受损害的，由违约方负责赔偿出借人的相应损失。</p>
      <p>2、如任何一方承担了按相关法律法规或本协议规定应由本协议其他各方承担的责任，或由于本协议其他各方的违约行为而对任何本协议之外的其他方承担责任或受到有权机关处罚，该方在承担责任后有权向违约方进行追偿并获得相应赔偿。</p>

      <h3>八、法律适用及争议解决</h3>
      <p>1、	本协议适用中华人民共和国法律。</p>
      <p>2、	本协议在履行过程中，如发生任何争执或纠纷，各方应友好协商解决。若协商不成，应向乙方住所地杭州市滨江区有管辖权的人民法院诉讼解决。</p>

      <h3>九、附则</h3>
      <p>1、本协议由各方通过服务界面以点击确认的方式签署。本协议文件一经甲方点击确认，即视为甲方亲笔签名，与线下纸质签约具有同等法律效力。<b>各方均承诺并确认：不以电子签署确认形式为由要求撤销本协议或者确认本协议无效或对本协议效力提出任何异议。</b>本协议经各方签署后立即成立并生效。</p>
      <p>2、本协议采用电子文本形式制成，并永久保存在乙方为此设立的专用服务器上备查，各方均认可该形式的协议效力。</p>
      <p><b>本合同双方承诺已详读及同意遵守本合同全部条款。</b></p>
      <div class="user-write-content">
        <p class="write-title">【以下无正文，仅供签署】</p>
        <div><p>协议各方签字盖章：</p></div>
        <div><p>甲方（借款人）：</p></div>
        <div><p>签章：</p></div>
        <div class="mt120"><p>乙方（服务方）：</p></div>
        <div><p>签章：</p></div>
        <!-- <div class="mt120"><p>丙方（服务方）：</p></div>
        <div><p>签章：</p></div> -->
        <div class="mt120 write-date"><p>签订日期：<span></span>年<span></span>月<span></span>日</p></div>
      </div>
      <div class="user-confirm-sheet mt120">
        <p class="confirm-tit">附件一：《借款费用确认单》</p>
        <p>本借款申请单从属于编号为<span></span>的《借款服务协议》，作为《借款服务协议》的一部分，与其具有同等法律效力。</p>
        <div class="user-confirm-table">
          <table border="0" cellspacing="0" cellpadding="0">
            <tr>
              <td>借款详细用途</td>
              <td>用于甲方个人<b>消费</b></td>
            </tr>
            <tr>
              <td>借款本金数额</td>
              <td>￥<span></span>元（大写：<span></span>整）</td>
            </tr>
            <tr>
              <td>借款费率</td>
              <td>
                <p>总月费率=<span></span>%</p>
                <!-- <p>（包含月利率、信息服务费）</p> -->
              </td>
            </tr>
            <tr>
              <td>还款方式</td>
              <td><p><span></span></p></td>
            </tr>
            <tr>
              <td>逾期收费</td>
              <td>
                <p><b>逾期罚息:</b><span></span><b>%</b></p>
                <p><b>逾期管理费:</b><span></span><b>%</b></p>
              </td>
            </tr>
            <tr>
              <td>提前还款违约金</td>
              <td>剩余本金*违约金比率<span></span>%</td>
            </tr>
            <tr>
              <td>借款周期</td>
              <td>从放款日开始计算<span></span>个月</td>
            </tr>            
            <tr>
              <td>还款计划表</td>
              <td>
                <p><b>每期还款计划，以放款日平台生成的还款账单为准</b></p>
                <p><b>（还款日当天23:30前还款，节假日不顺延）。</b></p>
              </td>
            </tr>
            <tr>
              <td>借款人收款账户</td>
              <td>
                <p>名称：<span></span></p>
                <p>账号：<span></span></p>
                <p>开户行：<span></span></p>
              </td>
            </tr>
          </table>
          <div class="applier"><p>申请人（签章）：<span></span></p></div>
          <div class="apply-time"><span></span>年<span></span>月<span></span>日</div>
        </div>
        <div class="auth-doc">
          <h3>附件二：借款承诺书</h3>
          <p>本人通过“泰然金融”平台发起借款请求，并按照平台借款流程，分别与平台、出借人签订借款相关协议。本人承诺借款流程中的如下事项：</p>
          <p>一、本人借款请求为自主发起，并按照平台流程做了实名验证。本人在相关借款申请材料中填写或授权查看的身份信息、信用信息等均真实准确无误。如本人提供虚假信息或者拒绝按还款计划按时还款，本人同意泰然金融采取宣布借款提前到期、上报征信机构、公安机关报案等方式追诉本人责任。</p>
          <p>二、平台已对本人资信状况、还款能力进行了充分的风险评估，本人填写的借款用途真实，不存在投资股票、场外配资、期货合约、结构化产品及其他衍生品等高风险用途，也不存在首付贷、赎楼贷、房地产场外配资等购房融资。</p>
          <p>三、本人已按照借款流程，在平台合作的存管银行处自主开通了存管子账户，并绑定个人银行卡用于收款、还款。本人明确知晓此次借款的所有收费项，平台及相关服务方在借款相关协议中，不存在从借款本金中先行扣除利息、保证金等“砍头息”条款，也不存在违规的线下收费。<b>本人同意并委托米今科技从我的存管子账户中代收借款本金，并在借款到期时从我的还款银行账户中代扣还款本息及服务费。</b></p>
          <p>四、本人非在校学生。本人通过不同网贷平台的借款总余额（含本次借款）不超过100万元。平台已将借款利息、其他所有收费、禁止性行为、违约后果等向本人做了充分的告知和风险提示。上述所有综合资金成本（含利息及各项收费）均已统一折算成年化形式，总计不超过借款本金的年化36%。</p>
          <p>五、本人同意并授权，蜂泰科技、泰然金融或其他借款服务方有权将本人提供的或其自行收集的个人信息（包括但不限于真实姓名、身份证号、银行卡号及开户银行、联系方式等）用于包括但不限于以下用途：基于履行协议、风控审核、提供服务、解决争议、保障交易安全、控制交易风险等目的使用，向包括但不限于出借人、债权受让人、征信机构、经授权进行贷后管理及逾期催收服务的第三方机构等披露。</p>
          <div class="user-confirm-table">
            <div class="applier"><p>借款人（签章）：<span></span></p></div>
            <div class="apply-time">时间：<span></span>年<span></span>月<span></span>日</div>
          </div>
          
        </div>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: "usersPersonalAuthPage",
  data() {
    return {};
  },
  created() {},
  methods: {}
};
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style lang="scss" scoped>
.contract-personal {
  h3 {
    text-align: left;
  }
  p {
    margin-top: 20px;
  }
}
.user-header {
  > div {
    line-height: 40px;
    > p {
      text-indent: 2em;
    }
  }
  .contract-number {
    text-align: right;
    span {
      display: inline-block;
      line-height: 40px;
    }
    span:last-child {
      width: 150px;
      border-bottom: 1px solid #333;
      margin-bottom: -5px;
    }
  }
  .user-first {
    > p {
      text-indent: 1em;
    }
    span {
      display: inline-block;
      line-height: 40px;
      font-weight: bold;
    }
    span:last-child {
      width: 150px;
      border-bottom: 1px solid #333;
      margin-bottom: -5px;
    }
  }
  .user-second {
    font-weight: bold;
  }
}
.mt20 {
  margin-top: 20px;
}
.mt40 {
  margin-top: 40px;
}
.user-write-content {
  margin-top: 80px;
  .write-title {
    text-align: center;
    line-height: 60px;
  }
}
.mt120 {
  margin-top: 120px;
}
.write-date {
  p {
    span {
      display: inline-block;
      width: 60px;
      height: 40px;
      line-height: 40px;
      border-bottom: 1px solid #333;
      margin: 0 10px;
    }
  }
}
.user-confirm-sheet {
  .confirm-tit {
    text-align: center;
    font-size: 150%;
    line-height: 100px;
  }
  p {
    span {
      display: inline-block;
      width: 100px;
      height: 40px;
      line-height: 40px;
      border-bottom: 1px solid #666;
      margin-bottom: -5px;
    }
  }
  .user-confirm-table {
    margin-top: 20px;
    table {
      width: 100%;
      border-left: 1px solid #666;
      border-top: 1px solid #666;
      td {
        border-right: 1px solid #666;
        border-bottom: 1px solid #666;
        padding: 10px 0 10px 40px;
        p {
          line-height: 50px;
          text-indent: 0;
        }
        span {
          display: inline-block;
          width: 100px;
          height: 40px;
          border-bottom: 1px solid #666;
          margin-bottom: -5px;
        }
      }
    }
    .applier {
      text-align: right;
      margin-top: 20px;
      span {
        display: inline-block;
        width: 120px;
        height: 40px;
        margin-bottom: -5px;
        border-bottom: 1px solid #666;
      }
    }
    .apply-time {
      text-align: right;
      margin-top: 20px;
      span {
        display: inline-block;
        width: 100px;
        height: 40px;
        margin-bottom: -5px;
        border-bottom: 1px solid #666;
      }
    }
  }
}
.auth-doc {
  h3 {
    font-size: 150%;
    font-weight: normal;
    text-align: center;
    margin-top: 180px;
  }
  p {
    span {
      display: inline-block;
      width: 120px;
      height: 40px;
      line-height: 40px;
      border-bottom: 1px solid #666;
      margin-bottom: -5px;
    }
  }
}
</style>
