<template>
  <div class="content">
    <div class="main-content user-contract">
      <h2>米今会员服务协议</h2>
      <p>本网站由杭州米今网络科技有限公司（以下简称“米今”或“本网站”）负责运营。本服务协议双方分别为米今与米今注册用户（以下简称“用户”或“您”），本服务协议适用于您在本网站的全部活动。请您在注册成为本网站用户前务必仔细阅读以下条款。若您一旦注册，则表示您同意接受本网站的服务,并同意受以下条款的约束。若您不同意接受以下条款，请您立即停止注册或主动停止使用本网站的服务。</p>
      <h3>一、协议的签订与修改</h3>
      <p>1、本网站只接受持有中华人民共和国有效身份证的（不包括香港特区、澳门特区及台湾地区）的18周岁以上的具有完全民事行为能力的自然人成为网站用户。如您不符合资格，请勿注册。本网站保留随时中止或终止您用户资格的权利。</p>
      <p>2、本服务协议内容包括以下条款及已经发布的或将来可能发布的各类规则。所有规则为协议不可分割的一部分，与协议正文具有同等法律效力。</p>
      <p>3、本网站有权根据中国的法律、法规、规章及其他政府规定不时地制定、修改本协议或各类规则，如本条款及规则有任何变更，一切变更以本网站最新公布条例为准，且无需另行单独通知您。米今将随时刊载并公告本协议及规则的变更情况，经修订的协议、规则一经公布，立即自动生效。您应不时地注意本协议及附属规则的变更，若您在本协议及具体规则内容公告变更后继续使用本服务的，表示您已充分阅读、理解并接受修改后的协议和具体规则内容，也将遵循修改后的协议和具体规则使用本网站的服务；同时就您在协议和具体规则修订前通过本网站进行的交易及其效力，视为您已同意并已按照本协议及有关规则进行了相应的授权和追认。若您不同意修改后的协议内容，您应停止使用本网站的服务。</p>
      <p>4、您按照本网站规定的注册程序成功注册为用户，您的行为即表示同意并签署了本服务协议。本服务协议不涉及您与本网站的其他用户之间因网上交易而产生的法律关系及法律纠纷，但您在此同意将全面接受和履行与本网站其他用户在本网站签订的任何电子法律文本，并承诺按该法律文本享有和/或放弃相应的权利、承担和/或豁免相应的义务。</p>
      <h3> 二、 使用限制</h3>
      <p>1、本网站中的全部内容的知识产权（包括但不限于商标权、专利权、著作权、商业秘密等）均属于本网站所有，该等内容包括但不限于文本、数据、文章、设计、源代码、软件、图片、照片及其他全部信息（以下称“网站内容”）。本网站内容受中华人民共和国著作权法、各国际版权公约以及其他知识产权法律法规与公约的保护。未经本网站事先书面同意，您不得以任何方式复制、模仿、传播、出版、公布、展示网站内容，包括但不限于电子的、机械的、复印的、录音录像的方式和形式等。未经本网站书面同意，您亦不得将本网站包含的资料等任何内容镜像到任何其他网站或者服务器。任何未经授权对网站内容的使用均属于违法行为，本网站将追究您的法律责任。</p>
      <p>2、您必须合法使用本网站提供的服务及网站内容，不得利用本服务从事侵害他人合法权益之行为，禁止在本网站从事任何可能违反中国现行的法律、法规、规章和政府规范性文件的行为或者任何未经授权使用本网站的行为，如擅自进入本网站的未公开的系统、不正当的使用密码和网站的任何内容等。如有违反而导致任何法律后果的发生，您将以自己的名义独立承担所有相应的法律责任。</p>
      <p>3、您注册成功后应妥善保管您的用户名以及密码。本网站通过您的账户及密码来识别您的指令。您确认，使用您的账户和密码登录本网站后在本网站的一切行为均代表您本人意志。使用您的账户和密码登陆操作所产生的电子信息记录均为您行为的有效凭据，并由您自行承担相应的法律后果。</p>
      <p>4、您有义务在注册时提供自己的真实、最新、完整的资料，并保证诸如电子邮件地址、联系电话、联系地址、邮政编码等内容的有效性及安全性。您有义务立即更新您的注册资料，确保其为真实、最新、有效及完整。以便本网站为您提供服务并与您进行及时、有效的联系。您应完全独自承担因通过这些联系方式无法与您取得联系而导致的您在使用本服务过程中遭受的任何损失或增加任何费用等不利后果。若您提供任何错误、虚假、过时或不完整的资料，或者本网站有合理的理由怀疑资料为错误、虚假、过时或不完整，本网站有权要求您立即修正，并可视具体情况暂停或终止您的账户，并拒绝您使用本网站服务的部份或全部功能。在此情况下，本网站不承担任何责任，您将自行负担因此所产生的直接或间接的任何支出或损失。</p>
      <h3>三、 涉及第三方网站</h3>
      <p>本网站内容可能涉及由第三方所有、控制或运营的其它网站（以下称“第三方网站”）。本网站不能保证也没有义务保证第三方网站上的信息的真实性和有效性。您应按照第三方网站的相关协议与规则使用第三方网站，而不是按照本协议。第三方网站的内容、产品、广告和其他任何信息均由您自行判断并承担风险，而与本网站无关。</p>
      <p>特别提示1：我们正在合作或者未来可能合作的托管银行或其他第三方机构因技术上的受限而可能会出现您在本网站页面进行身份验证并点击信息保存后跳转至第三方页面时个人信息仍然可编辑的情形，对此，我们慎重地提示您请不要在第三方页面上对可编辑信息进行再次修改，请您务必保证您在本网站及本网站合作的第三方机构上所填写及认证的个人信息保持完全一致。否则因您擅自修改个人信息导致米今的备存信息与其他第三方机构信息不一致而产生的全部法律后果将由您个人承担，对此您已充分的了解并予以承诺。</p>
      <p>特别提示2：为了更好的开展本网站的业务，我们可能会与其他第三方机构进行合作，比如（以下仅为举例说明，本协议将对包括但不限于如下合作的所有第三方机构适用）为了确保您在本网站的操作及所签署的协议具备更强的法律效力我们会与第三方签章平台进行合作以确保您在本网站上的签约具备更强的法律效力。您在接受本协议时即表示您已经知晓并且同意本网站在有需要时会将您的个人身份信息提供给第三方平台，我们保证该信息仅用作生成您的个人电子签章而不会被用作其除此以外的任何其他用途。</p>
      <p>同时您同意本网站或本网站合作机构在提供服务时需要您配合反馈时给予必要配合，这里的配合包括但不限于您注册时作为该账户名称或者与该账户绑定的手机或其他专属于您的通讯工具（以下合称该手机）号码向本网站或本网站合作机构发送的信息（短信或电话等）回复。因为您的不配合导致您无法及时完整的享受到本网站服务的，该后果将由您自行承担。</p>
      <p>您在接受本协议时即表示您对上述内容的接受及对本网站执行相关操作时的授权，本网站在接入第三方合作机构并执行相关操作时将不再单独通知您或另行取得相应授权。</p>
      <h3>四、 不保证</h3>
      <p>本网站提供的服务中不带有对本网站中的任何用户、任何交易的任何担保或条件，无论是明示、默示或法定的。用户信息系由用户自行发布和提供，本网站不承担任何形式的证明、鉴定服务，您依赖于您自己的判断进行交易，您应对您的判断承担全部责任，在任何情况下，本网站及其股东、创建人、高级职员、董事、代理人、关联公司、母公司、子公司和雇员（以下称“本网站方”）均不以任何明示或默示的方式对您使用本网站服务而产生的任何形式的直接或间接损失承担法律责任，包括但不限于资金损失、利润损失、营业中断损失等。</p>
      <p>因为本网站或者涉及的第三方网站的设备、系统存在缺陷、黑客攻击、网络故障、电力中断、计算机病毒或其他不可抗力因素造成的损失，本网站均不负责赔偿，您的补救措施只能是与本网站协商终止本协议并停止使用本网站。但是，中国现行法律、法规另有规定的除外。</p>
      <p>除本协议另有规定外，在任何情况下，本网站对本协议所承担的违约赔偿责任总额不超过向您收取的当次本网站服务费用总额。</p>
      <h3>五、 网站内容监测</h3>
      <p>本网站没有义务监测网站内容，但是您确认并同意本网站有权不时地根据法律、法规、政府要求透露、修改或者删除必要的、合适的信息，以便更好地运营本网站并保护自身及本网站的其他合法用户。</p>
      <h3>六、 个人信息的使用</h3>
      <p>本网站对于您提供的、本网站自行收集到的、经认证的个人信息将按照本网站的隐私规则予以保护、使用或者披露（本网站对您的个人信息的具体使用规则的具体条款适用本网站的《个人隐私规则》），但是以下情况信息披露除外：</p>
      <p>1、您使用本网站服务进行交易时，您即授权本公司将您的包括但不限于真实姓名、联系方式、信用状况等必要的个人信息和交易信息披露给与您交易的另一方或本网站的合作机构（仅限于本网站为完成拟向您提供的服务而合作的机构）。</p>
      <p>2、本网站有义务根据有关法律要求向司法机关和政府部门提供您的个人资料。</p>
      <p>3、经国家生效法律文书或行政处罚决定确认您存在违法行为，或者本网站有足够事实依据可以认定您存在违法或违反本注册协议的行为的或者您借款逾期未还的，您同意并授权本网站在本网站及互联网络上公布您的违法、违约行为，并将该内容记入任何与您相关的信用资料和档案。</p>
      <p>4、当您作为借入人借款逾期未还时，作为借出人的其他用户或其授权代理人可以采取发布您的个人信息方式追索债权，但本网站对该等借出人的行为免责。</p>
      <p>5、当您因网上交易与其他用户产生诉讼的，其他用户有权通过司法部门要求网站提供相关资料，本网站对该披露行为免责。</p>
      <h3>七、 索赔</h3>
      <p>由于您违反本协议或任何法律、法规或侵害第三方的权利，而引起第三方对本网站提出的任何形式的索赔、要求、诉讼。本网站有权向您追偿相关损失，包括但不限于本网站法律费用、名誉损失、及向第三方支付的补偿金等。</p>
      <h3>八、 通知</h3>
      <p>本协议项下的通知如以公示方式作出，一经在本网站公示即视为已经送达。除此之外，其他向您个人发布的具有专属性的通知将由本网站向您在注册时提供的电子邮箱，或本网站在您的个人账户中为您设置的站内消息系统栏，或您在注册后在本网站绑定的手机发送，一经发送即视为已经送达。请您密切关注您的电子邮箱 、站内消息系统栏中的邮件、信息及手机中的短信信息。您同意本网站出于向您提供服务之目的，可以向您的电子邮箱、站内消息系统栏和手机发送有关通知或提醒；若您不愿意接收，请在本网站相应系统版块进行设置。但您同时同意并确认，若您设置了不接收有关通知或提醒，则您有可能收不到该等通知信息，您不得以您未收到或未阅读该等通知信息主张相关通知未送达于您。</p>
      <h3>九、 适用法律和管辖</h3>
      <p>本协议的履行地为本网站所在地/实际营业地。本协议之效力、解释、变更、执行与争议解决均适用中华人民共和国法律，因本协议产生之争议，由本网站住所地的人民法院管辖。</p>
      <h3>十、 附加条款</h3>
      <p>在本网站的某些部分或页面中可能存在除本协议以外的单独的附加服务条款，当这些条款存在冲突时，在该些部分和页面中附加条款优先适用。</p>
      <h3>十一、 条款的独立性</h3>
      <p>若本协议的部分条款被认定为无效或者无法实施时，本协议中的其他条款仍然有效。</p>
      <h3>十二、 投诉及建议</h3>
      <p>若您对本网站有任何投诉和建议，您可以将投诉信发送到本网站指定的如下邮箱： hzxgf @tairanchina.com。</p>
    </div>
  </div>
</template>

<script>
  export default {
    name: 'usersContractPage',
    data () {
      return {}
    },
    created(){
    },
    methods: {
    }
  }
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style lang="scss" scoped>

</style>
